
# Pandas DataFrame exercises

In [18]:
# Import the numpy package under the name np
import numpy as np

# Import the pandas package under the name pd
import pandas as pd

# Import the matplotlib package under the name plt
import matplotlib.pyplot as plt
%matplotlib inline

# Print the pandas version and the configuration
print(pd.__version__)

1.3.4


## DataFrame creation

### Create an empty pandas DataFrame

In [19]:
# your code goes here
df= pd.DataFrame()

In [20]:
pd.DataFrame(data=[None],
             index=[None],
             columns=[None])

      NaN
NaN  None

<img width="800" height="200" src="https://media1.tenor.com/images/47c1a3d90e55aa8f9f474ec1f68ea09c/tenor.gif?itemid=16810290" ></img>



### Create a `marvel_df` pandas DataFrame with the given marvel data

In [21]:
marvel_data = [
    ['Spider-Man', 'male', 1962],
    ['Captain America', 'male', 1941],
    ['Wolverine', 'male', 1974],
    ['Iron Man', 'male', 1963],
    ['Thor', 'male', 1963],
    ['Thing', 'male', 1961],
    ['Mister Fantastic', 'male', 1961],
    ['Hulk', 'male', 1962],
    ['Beast', 'male', 1963],
    ['Invisible Woman', 'female', 1961],
    ['Storm', 'female', 1975],
    ['Namor', 'male', 1939],
    ['Hawkeye', 'male', 1964],
    ['Daredevil', 'male', 1964],
    ['Doctor Strange', 'male', 1963],
    ['Hank Pym', 'male', 1962],
    ['Scarlet Witch', 'female', 1964],
    ['Wasp', 'female', 1963],
    ['Black Widow', 'female', 1964],
    ['Vision', 'male', 1968]
]

In [22]:
# your code goes here
marvel_df = pd.DataFrame(marvel_data)
marvel_df

                   0       1     2
0         Spider-Man    male  1962
1    Captain America    male  1941
2          Wolverine    male  1974
3           Iron Man    male  1963
4               Thor    male  1963
5              Thing    male  1961
6   Mister Fantastic    male  1961
7               Hulk    male  1962
8              Beast    male  1963
9    Invisible Woman  female  1961
10             Storm  female  1975
11             Namor    male  1939
12           Hawkeye    male  1964
13         Daredevil    male  1964
14    Doctor Strange    male  1963
15          Hank Pym    male  1962
16     Scarlet Witch  female  1964
17              Wasp  female  1963
18       Black Widow  female  1964
19            Vision    male  1968



### Add column names to the `marvel_df`

In [23]:
# your code goes here
marvel_df.rename(columns={0:'Name',1:'Gender',2:'Date'}, inplace=True)
marvel_df

                Name  Gender  Date
0         Spider-Man    male  1962
1    Captain America    male  1941
2          Wolverine    male  1974
3           Iron Man    male  1963
4               Thor    male  1963
5              Thing    male  1961
6   Mister Fantastic    male  1961
7               Hulk    male  1962
8              Beast    male  1963
9    Invisible Woman  female  1961
10             Storm  female  1975
11             Namor    male  1939
12           Hawkeye    male  1964
13         Daredevil    male  1964
14    Doctor Strange    male  1963
15          Hank Pym    male  1962
16     Scarlet Witch  female  1964
17              Wasp  female  1963
18       Black Widow  female  1964
19            Vision    male  1968


### Add index names to the `marvel_df` (use the character name as index)

In [24]:
# your code goes here
marvel_df.set_index('Name', inplace=True)
marvel_df

                  Gender  Date
Name
Spider-Man          male  1962
Captain America     male  1941
Wolverine           male  1974
Iron Man            male  1963
Thor                male  1963
Thing               male  1961
Mister Fantastic    male  1961
Hulk                male  1962
Beast               male  1963
Invisible Woman   female  1961
Storm             female  1975
Namor               male  1939
Hawkeye             male  1964
Daredevil           male  1964
Doctor Strange      male  1963
Hank Pym            male  1962
Scarlet Witch     female  1964
Wasp              female  1963
Black Widow       female  1964
Vision              male  1968


### Drop the name column as it's now the index

In [31]:
# your code goes here





### Drop 'Namor' and 'Hank Pym' rows

In [32]:
# your code goes here
marvel_df.drop(['Namor','Hank Pym'],inplace=True)


## DataFrame selection, slicing and indexation

### Show the first 5 elements on `marvel_df`

In [33]:
# your code goes here
marvel_df.head()

                Gender  Date
Name
Spider-Man        male  1962
Captain America   male  1941
Wolverine         male  1974
Iron Man          male  1963
Thor              male  1963


### Show the last 5 elements on `marvel_df`

In [34]:
# your code goes here
marvel_df.tail()

                Gender  Date
Name
Doctor Strange    male  1963
Scarlet Witch   female  1964
Wasp            female  1963
Black Widow     female  1964
Vision            male  1968


### Show just the sex of the first 5 elements on `marvel_df`

In [38]:
# your code goes here
marvel_df['Gender'].head()

Name
Spider-Man         male
Captain America    male
Wolverine          male
Iron Man           male
Thor               male
Name: Gender, dtype: object



### Show the first_appearance of all middle elements on `marvel_df`

In [46]:
# your code goes here
marvel_df.iloc[1:len(marvel_df.index)-1,:]

                  Gender  Date
Name
Captain America     male  1941
Wolverine           male  1974
Iron Man            male  1963
Thor                male  1963
Thing               male  1961
Mister Fantastic    male  1961
Hulk                male  1962
Beast               male  1963
Invisible Woman   female  1961
Storm             female  1975
Hawkeye             male  1964
Daredevil           male  1964
Doctor Strange      male  1963
Scarlet Witch     female  1964
Wasp              female  1963
Black Widow       female  1964


### Show the first and last elements on `marvel_df`

In [48]:
# your code goes here
marvel_df.iloc[0::len(marvel_df.index)-1,:]

           Gender  Date
Name
Spider-Man   male  1962
Vision       male  1968



## DataFrame manipulation and operations

### Modify the `first_appearance` of 'Vision' to year 1964

In [50]:
# your code goes here 
marvel_df.loc["Vision","Date"]=1964
marvel_df.iloc[0::len(marvel_df.index)-1,:]

           Gender  Date
Name
Spider-Man   male  1962
Vision       male  1964



### Add a new column to `marvel_df` called 'years_since' with the years since `first_appearance`

In [51]:
# your code goes here
marvel_df["years_since"]=2022-marvel_df["Date"]

In [52]:
marvel_df

                  Gender  Date  years_since
Name
Spider-Man          male  1962           60
Captain America     male  1941           81
Wolverine           male  1974           48
Iron Man            male  1963           59
Thor                male  1963           59
Thing               male  1961           61
Mister Fantastic    male  1961           61
Hulk                male  1962           60
Beast               male  1963           59
Invisible Woman   female  1961           61
Storm             female  1975           47
Hawkeye             male  1964           58
Daredevil           male  1964           58
Doctor Strange      male  1963           59
Scarlet Witch     female  1964           58
Wasp              female  1963           59
Black Widow       female  1964           58
Vision              male  1964           58


## DataFrame boolean arrays (also called masks)

### Given the `marvel_df` pandas DataFrame, make a mask showing the female characters

In [53]:
# your code goes here
marvel_df[marvel_df["Gender"]=="female"]

                 Gender  Date  years_since
Name
Invisible Woman  female  1961           61
Storm            female  1975           47
Scarlet Witch    female  1964           58
Wasp             female  1963           59
Black Widow      female  1964           58


### Given the `marvel_df` pandas DataFrame, get the male characters

In [56]:
# your code goes here
marvel_df[marvel_df["Gender"]=="male"]

                 Gender  Date  years_since
Name
Spider-Man         male  1962           60
Captain America    male  1941           81
Wolverine          male  1974           48
Iron Man           male  1963           59
Thor               male  1963           59
Thing              male  1961           61
Mister Fantastic   male  1961           61
Hulk               male  1962           60
Beast              male  1963           59
Hawkeye            male  1964           58
Daredevil          male  1964           58
Doctor Strange     male  1963           59
Vision             male  1964           58


### Given the `marvel_df` pandas DataFrame, get the characters with `first_appearance` after 1970

In [57]:
# your code goes here
marvel_df[marvel_df["Date"]>1970]

           Gender  Date  years_since
Name
Wolverine    male  1974           48
Storm      female  1975           47



### Given the `marvel_df` pandas DataFrame, get the female characters with `first_appearance` after 1970

In [60]:
# your code goes here
marvel_df[(marvel_df["Gender"]=="female") & (marvel_df["Date"]>1970)]

       Gender  Date  years_since
Name
Storm  female  1975           47


## DataFrame summary statistics

### Show basic statistics of `marvel_df`

In [61]:
# your code goes here
marvel_df.describe()

              Date  years_since
count    18.000000    18.000000
mean   1962.888889    59.111111
std       6.720372     6.720372
min    1941.000000    47.000000
25%    1962.000000    58.000000
50%    1963.000000    59.000000
75%    1964.000000    60.000000
max    1975.000000    81.000000


### Given the `marvel_df` pandas DataFrame, show the mean value of `first_appearance`

In [66]:
# your code goes here
marvel_df['Date'].mean()

1962.888888888889



### Given the `marvel_df` pandas DataFrame, show the min value of `first_appearance`

In [67]:
# your code goes here 

marvel_df['Date'].min()

1941

### Given the `marvel_df` pandas DataFrame, get the characters with the min value of `first_appearance`

In [70]:
# your code goes here
marvel_df[marvel_df['Date']== marvel_df['Date'].min() ]

                Gender  Date  years_since
Name
Captain America   male  1941           81